app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
  <%= link_to book_favorites_path(book), class: "like", method: :delete, remote: true do %>
    ♥<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
  <%= link_to book_favorites_path(book), class: "unlike", method: :post, remote: true do %>
    ♥<%= book.favorites.count %>