app/views/post_comments/_comment_lists.html.erb

<div class="comment-list">
  <% book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]