app/views/books/_book_lists.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
            <%= link_to book_favorites_path(book), class:"like", method: :delete do %>
              ♥<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
            <%= link_to book_favorites_path(book), class:"unlike", method: :post do %>
              ♥<%= book.favorites.count %>

SELECT "books".* FROM "books" WHERE (title LIKE '%a%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
        </td>
        <td>コメント数 : <%= book.book_comments.count %></td>