app/views/books/_book_lists.html.erb

SELECT "books".* FROM "books" WHERE (title LIKE '%a%')
---
        </td>
        <td>コメント数 : <%= book.book_comments.count %></td>