app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                  <%= link_to book_favorites_path(@show_book), class:"like", method: :delete do %>
                    ♥<%= @show_book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                  <%= link_to book_favorites_path(@show_book), class:"unlike", method: :post do %>
                    ♥<%= @show_book.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
            <td>
              コメント数 : <%= @show_book.book_comments.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
      <div class="comments">
        <% @show_book.book_comments.each do |book_comment| %>