app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @books = Book.page(params[:page]).reverse_order

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "タイトル"], ["body", "ssss"], ["user_id", 3], ["created_at", "2021-04-30 04:18:52.272493"], ["updated_at", "2021-04-30 04:18:52.272493"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @user = current_user
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @show_book = Book.find(params[:id])