app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["book_id", 5], ["created_at", "2021-06-04 10:26:10.594792"], ["updated_at", "2021-06-04 10:26:10.594792"]]
---
  def create
    unless current_user.favorites.include?(clicked_like)
      @book = Book.find(params[:book_id])
      favorite = current_user.favorites.new(book_id: @book.id)
      favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def clicked_like
    Book.find(params[:book_id])