app/controllers/users_controller.rb

  def index
    @user = current_user
    @users = User.page(params[:page])
---
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]

  def show
    @book = Book.new
    @user = User.find(params[:id])
    @books = @user.books.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "kabigon"], ["introduction", "お腹すいたな"], ["profile_image_id", "87b037474a7f8d951dbe3456b1bb28726fca87588466ea2e60d794ca251e"], ["updated_at", "2021-04-30 05:33:06.443635"], ["id", 2]]

  def followers
    @user = User.find(params[:id])
    @users = @user.followers.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]